/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: haryu <haryu@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/30 22:32:27 by haryu             #+#    #+#             */
/*   Updated: 2021/12/30 22:42:34 by haryu            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int main(void)
{
	int a = 10;
	int b;
	b=ft_printf("hello world %%\n안녕하세요 반갑습니다\n 로직테스트 중입니다\n 정수나옵니다 \r 진짜로 %d 또 %c 또 %p", a);
	return (0);
}
